class Morse {
  Map<String, String> _morseCode = {
    // Буквы A-Z
    'A': '.-',
    'B': '-...',
    'C': '-.-.',
    'D': '-..',
    'E': '.',
    'F': '..-.',
    'G': '--.',
    'H': '....',
    'I': '..',
    'J': '.---',
    'K': '-.-',
    'L': '.-..',
    'M': '--',
    'N': '-.',
    'O': '---',
    'P': '.--.',
    'Q': '--.-',
    'R': '.-.',
    'S': '...',
    'T': '-',
    'U': '..-',
    'V': '...-',
    'W': '.--',
    'X': '-..-',
    'Y': '-.--',
    'Z': '--..',

    // Цифры 0-9
    '0': '-----',
    '1': '.----',
    '2': '..---',
    '3': '...--',
    '4': '....-',
    '5': '.....',
    '6': '-....',
    '7': '--...',
    '8': '---..',
    '9': '----.',

    // Знаки препинания и символы
    '.': '.-.-.-', // Точка
    ',': '--..--', // Запятая
    '?': '..--..', // Вопросительный знак
    '!': '-.-.--', // Восклицательный знак
    ';': '-.-.-.', // Точка с запятой
    ':': '---...', // Двоеточие
    "'": '.----.', // Апостроф
    '"': '.-..-.', // Кавычки
    '(': '-.--.', // Открывающая скобка
    ')': '-.--.-', // Закрывающая скобка
    '[': '-.--.', // Открывающая квадратная скобка (альтернатива)
    ']': '-.--.-', // Закрывающая квадратная скобка (альтернатива)
    '{': '-.--.', // Открывающая фигурная скобка
    '}': '-.--.-', // Закрывающая фигурная скобка
    '/': '-..-.', // Косая черта
    '\\': '-..-.', // Обратная косая черта
    '@': '.--.-.', // Собака (@)
    '&': '.-...', // Амперсанд
    '*': '.-..-.', // Звёздочка (реже .-..-.)
    '=': '-...-', // Равно
    '+': '.-.-.', // Плюс
    '-': '-....-', // Минус/дефис
    '_': '..--.-', // Нижнее подчёркивание
    '\$': '...-..-', // Доллар
    ' ': '/', // Пробел (обычно обозначается как пауза)
    // Служебные коды
    'SOS': '...---...', // Международный сигнал бедствия
    'ERR': '........', // Ошибка
    'AR': '.-.-.', // Конец сообщения (конец передачи)
    'SK': '...-.-', // Конец связи
  };

  // Обратный словарь (Морзе -> буква) для декодирования
  Map<String, String> get _morseToText =>
      _morseCode.map((key, value) => MapEntry(value, key));

  String encode(String plaintext) {
    plaintext = plaintext.toUpperCase();
    String morsetext = '';
    for (int i = 0; i < plaintext.length; i++) {
      if (_morseCode.containsKey(plaintext[i])) {
        morsetext += _morseCode[plaintext[i]]!;
      } else {
        morsetext += '';
      }
      morsetext += ' ';
    }
    return morsetext.substring(0, morsetext.length-1);
  }

  String decode(String morsetext) {
    String plaintext = '';
    List<String> words = morsetext.split(' / ');
    for(int i = 0; i < words.length; i++){
      List<String> letters = words[i].split(' ');
      for(int j = 0; j < letters.length; j++){
        if(_morseToText.containsKey(letters[j])){
          plaintext += _morseToText[letters[j]]!;
        }
      }
      plaintext += ' ';
    }
    return plaintext;
  }
}
